print("У тебя сегодня ДР. И к тебе пришел враг всей твоей школы")
ans = int(input("1) убить его 2) пообщаться с ним о жини"))
if ans == 2:
    print = input("Круто, ты решил с ним поговорил о жииииизни. Он тебя облил горячим соооком)")
    ans = int(input("1) ты его начал гонять по всей стране 2) взял и съел его)"))

    if ans == 2:
        print = input("съел ты этого челаааа и потом")
        ans = int(input("1) ты взял и подвился 2) жевал - жевал, недоживал и выплюнул"))

        if ans == 1:
            print = input("Подовился")
        else:
            print = input("И ты сдох вместе с этим челом,который у тебя в животе")
    else:
        print("не дожевал выплюнул и чел убежал от тебя пока ты его съел снова")
        if:
            ans = input("какой он на вкус?)")

else:
    print("что бы ты сделал(а) в таком случае")
    ans = int(input("1) побегал(а) за ним немного или попыталась(ся) просто с ним договориться 2) ты прихлопнеш его книжкой по ГеОмЕтРиИ")
    if ans == 1:
        print("Круто ты его прихлопнул(а) ГеОмЕтРиИ, он упал и чуть не умер")
    else:
        print("ПОЗДРАВЛЯЮ!!! Ты выбрал(а) за ним немного побегать и потом поговорить о его ПоВеДеНиЕ")
    if:
    print("он после того как с тобой говорил начал...")
    ans = int(input("1) хорошо вести и никого необижать 2) он стал хуже вести себя")
    if ans == 1:
        print("вышел из школы с красным отесатом и пошел в лучший универ")
    else:
        print("он попал в психушку из-за нервного срыва")
else:
