print("У тебя сегодня ДР. И к тебе пришел враг всей твоей школы")
ans = int(input("1) убить его 2) пообщаться с ним о жини"))
if ans == 2:
    print = input("Круто, ты решил с ним поговорил о жииииизни. Он тебя облил горячим соооком)")
    ans = int(input("1) ты его начал гонять по всей стране 2) взял и съел его)"))

    if ans == 2:
        print = input("съел ты этого челаааа и потом")
        ans = int(input("1) ты взял и подвился 2) жевал - жевал, недоживал и выплюнул"))

        if ans == 1:
            print = input("Подовился")
        else:
            print = input("И ты сдох вместе с этим челом,который у тебя в животе")
    else:
        print("")
